/* AGO English strings (T-AGO-20) */

/* Drop zone */
"drop.title" = "Drag a .app, .dmg, or .pkg here";
"drop.subtitle" = "Unquarantine → verify → run in one flow";
"drop.choose" = "Choose File…";
"drop.chooseAnother" = "Choose Another File…";
"drop.clearHelp" = "Clear selection";
"drop.helpLink" = "Open Help ⌘/";
"drop.helpLinkHelp" = "Open AGO help";
"drop.version" = "Version %@";
"drop.panelMessage" = "Please choose an .app, .dmg, or .pkg file.";
/* Timeline */
"step.check" = "Check";
"step.clean" = "Remove";
"step.verify" = "Verify";
"step.run" = "Run";

/* Terminal log */
"log.title" = "Activity Log";
"log.copied" = "Copied";
"log.copy" = "Copy";
"log.copyHelp" = "Copy the entire log";
"log.empty" = "Drop an app to see the progress log here.";

/* Verdict card */
"verdict.passTitle" = "Inspection Passed";
"verdict.passBody" = "Valid signature · Gatekeeper accepted — press Run to open it";
"verdict.tamperedTitle" = "Suspected tampering — %d files added or modified";
"verdict.devTitle" = "Unapproved Gatekeeper signature (development)";
"verdict.brokenTitle" = "Signature verification failed";
"verdict.advice" = "Reinstalling from the official source is recommended";
"verdict.moreFiles" = "%d more — see the log for all";
"verdict.acknowledge" = "I understand the risk and run it";
"verdict.cannotRun" = "Cannot run — rejected by Gatekeeper";
"verdict.provenance" = "macOS 26+ origin stamp removed too — prevents another Gatekeeper confirmation at launch";

/* Help */
"help.title" = "AGO Help";
"help.close" = "Close";
"help.s1t" = "Why do I need this?";
"help.s1b" = "Apps, disk images, and installer packages from the internet carry the quarantine attribute (com.apple.quarantine) and won’t open directly. On macOS 26+, the provenance stamp (com.apple.provenance) can trigger another Gatekeeper confirmation at launch. AGO clears both attributes → verifies the signature → runs the Gatekeeper assessment → opens the target in one flow.";
"help.s2t" = "How to use it";
"help.s2b" = "1. Drag a .app / .dmg / .pkg or pick one with ⌘O\n2. The pipeline inspects automatically (check → remove → verify)\n3. On pass, press Run; on warning, read the card and tick the checkbox";
"help.s3t" = "What the warning means";
"help.s3b" = "A red warning means the app signature and its actual files differ. It can happen during updates, but it can also be malicious tampering — reinstalling from the official source is safest.";
"help.s4t" = "What it never does";
"help.s4b" = "No anonymous re-signing (adhoc) · developer identity signing only after confirmation · no automatic sudo escalation · no launching without your confirmation";
"help.s5t" = "What each file type does";
"help.s5b" = ".app: inspect → clear stamps → verify signature → sign (optional) → Gatekeeper assess → run\n.dmg: mounts and extracts the inner app (installer DMGs yield .pkg) → hands off to that pipeline. A temp copy is inspected\n.pkg: signature and install assessment only, then open the installer — never re-signed";
"help.s6t" = "Ready vs. warning";
"help.s6b" = "Ready: signature and Gatekeeper both passed — press Run yourself\nWarning (blocked): Gatekeeper rejection or suspected tampering — read the red card, then tick the checkbox to enable Run\nThere is no auto-launch. You always confirm and run it yourself";
"help.s7t" = "Common problems";
"help.s7b" = "Permission failed: move the item to a writable folder (e.g. ~/Downloads) and retry
Gatekeeper rejected: read the warning card → tick the checkbox → Run (opens via Terminal delegate)
First launch says it can't be verified: Control-click → Open (once)
Still stuck? Reinstall from the official source or contact us";
"help.madeBy" = "Made by BoRaSaRang";
"help.contact" = "Contact";

/* App */
"app.run" = "Run App";
"app.runHelpBlocked" = "Read the warning card and tick the checkbox first";
"app.runHelpReady" = "Run the inspected app";
"app.cancel" = "Cancel";
"app.help" = "Help";
"app.quit" = "Quit";
"app.contact" = "Contact";
"app.quitting" = "Quitting automatically in %d…";
"menu.open" = "Open…";

/* Status */
"status.idle" = "Idle";
"status.inspecting" = "Inspecting";
"status.cleaning" = "Removing quarantine";
"status.verifying" = "Verifying";
"status.ready" = "Ready";
"status.blocked" = "Warning";

/* Pipeline log */
"pipe.start" = "Inspecting: %@";
"pipe.stampsFound" = "%d stamp entries detected (recursive bundle scan)";
"pipe.noQuarantine" = "No quarantine flag — skipping removal";
"pipe.removed" = "Quarantine flag removed";
"pipe.provenanceFound" = "macOS origin stamp detected — com.apple.provenance";
"pipe.provenanceRemoved" = "Origin stamp removed (com.apple.provenance)";
"pipe.maclFound" = "Permission attribution stamp detected — com.apple.macl";
"pipe.maclRemoved" = "Permission attribution stamp removed (com.apple.macl)";
"pipe.formatOK" = "Format check passed: %@";
"pipe.signOK" = "Signature valid (valid on disk)";
"pipe.tampered" = "Suspected tampering: %d files added or modified";
"pipe.signFail" = "Signature verification failed: %@";
"pipe.spctlOK" = "Gatekeeper accepted";
"pipe.ready" = "Ready — press Run to open the app";
"pipe.warnTampered" = "Warning — suspected tampering. Read the card, tick the checkbox, then run";
"pipe.devSig" = "Development signature — Gatekeeper rejects it because it is not for distribution";
"pipe.devHint" = "Read the contents, tick the checkbox, then run";
"pipe.cancelled" = "Cancelled";
"pipe.procFail" = "Process launch failed: %@";
"pipe.launched" = "App launched";

/* Errors */
"err.inspect" = "Failed to read the quarantine attribute. Check the path and permissions.";
"err.remove" = "Failed to remove the quarantine attribute. If it's a permission issue, retry outside /Applications.";
"err.sign" = "The app signature is broken or tampering is suspected. Download it again from the official source.";
"err.gatekeeper" = "Gatekeeper refused to run it. %@";
"err.launch" = "Failed to launch the app. %@";
"err.notapp" = "Unsupported file. Only .app / .dmg / .pkg are allowed. %@";
"err.validation" = "Invalid input. %@";

/* 서명 단계 (T-AGO-21~23) */
"step.sign" = "Sign";
"sign.askTitle" = "Sign this app?";
"sign.askBody" = "This app will be signed with %@. You can skip and continue without signing.";
"sign.skipToggle" = "Skip signing";
"sign.skipToggleHelp" = "When checked, skips signing automatically without asking.";
"pipe.signAutoSkipped" = "Skipping signing (checked by default) — continuing without signing.";
"sign.doSign" = "Sign";
"sign.skip" = "Skip";
"sign.noIdentityTitle" = "No signing identity";
"sign.noIdentityBody" = "Signing requires an Apple ID signed in to Xcode. You can skip and continue without signing.";
"sign.guide1" = "1. Press Open Xcode below to launch Xcode";
"sign.guide2" = "2. In Settings > Accounts, add your Apple ID with the + button (free)";
"sign.guide3" = "3. Press Check Again. When it appears, press Sign";
"sign.manualPlaceholder" = "Enter identity manually (e.g. Apple Development: a@b.c (TEAMID))";
"sign.openXcode" = "Open Xcode";
"sign.recheck" = "Check Again";
"sign.noXcode" = "Xcode is not installed.";
"pipe.identities" = "Found %d signing identities";
"pipe.signSkipped" = "Signing skipped — continuing with the existing flow";
"pipe.signed" = "Signed: %@";
"err.signing" = "Failed to sign the app. %@";
"verdict.signed" = "Signed with a developer identity (Gatekeeper assessment is separate)";

/* Update check (v0.2.2) */
"update.badge" = "%@ available";
"update.sheetTitle" = "A new version is available";
"update.current" = "Current %@";
"update.latest" = "Latest %@";
"update.notesTitle" = "Release notes";
"update.methodBody" = "1. Download the DMG with the Download button.\n2. Open it and drag AGO.app to your Applications folder.\n3. If macOS says it can't be verified on first launch, Control-click → Open.";
"update.download" = "Download";
"update.later" = "Later";
"update.check" = "Check for Updates";
"update.checking" = "Checking…";
"update.upToDate" = "You're up to date";
"update.noRelease" = "No releases published yet";
"update.fetchFailed" = "Couldn't load releases";
"update.freqTitle" = "Check frequency";
"update.freqLaunch" = "At launch";
"update.freqDaily" = "Daily";
"update.freqWeekly" = "Weekly";
"update.freqNever" = "Never";
"pipe.dmgMount" = "Preparing to mount DMG…";
"pipe.dmgMounted" = "Mounted: %@";
"pipe.dmgDetached" = "DMG detached";
"pipe.dmgFoundApp" = "Found app inside: %@";
"pipe.dmgFoundPkg" = "Found package inside: %@";
"pipe.dmgExtractedPkg" = "Extracted package: %@";
"pipe.dmgNoAppOrPkg" = "No .app or .pkg found inside the DMG.";
"pipe.dmgExtracted" = "Extracted app: %@";
"pipe.dmgNoApp" = "No .app found inside the DMG.";
"pipe.dmgCopyFail" = "Failed to copy the app out of the DMG.";
"pipe.pkgSigned" = "PKG signature OK: %@";
"pipe.pkgUnsigned" = "PKG is unsigned.";
"pipe.pkgSignFail" = "PKG signature check failed: %@";
"pipe.pkgNoSign" = "Installer packages skip the app signing step.";
"err.dmg" = "DMG mount/extract failed: %@";
